Autodesk.Revit.DB.BRepBuilderEdgeGeometry.Create(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors startPoint and endPoint are coincident.
Since:
2016

Autodesk.Revit.DB.BRepBuilderEdgeGeometry.Create(Autodesk.Revit.DB.Curve)
Construct BRepBuilderEdgeGeometry based on any GCurve, including GLine and GArc.
The curve will be simplified if possible, and the concrete type of the returned value will reflect
that simplification: BRepBuilderLinearEdgeGeometry if the curve could be simplified to a line,
BRepBuilderArcEdgeGeometry if it could be simplified to an arc, BRepBuilderGenericCurveEdgeGeometry
otherwise.
curve:
The 3D curve for this edge. This BRepBuilderEdgeGeometry stores a copy of the input curve.
The use of isCurveOpenOrShort as a validator instead of isCurveOpen is a compromise to allow
the creation of geometry that is normally considered unacceptable due to edges that are shorter
than Revit allows.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
The curve is degenerate (its length is too close to zero).
-or-
The endpoints of the curve are close enough that Revit considers it a closed curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.BRepBuilderEdgeGeometry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BRepBuilderEdgeGeometry
An abstract class used by BRepBuilder to represent the geometry of an edge. Specific edge-geometry representations are represented by subclasses.
Since:
2016